In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [2]:
S1 = Series([10,20,30,40])
S1

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
S2 = Series([10,20,30,40],index=['A','B','C','D'])
S2

A    10
B    20
C    30
D    40
dtype: int64

In [4]:
scores = [92,88,95,85,98]
students = ['Gary','Alex','Chris','Tom','Cathy']
S3 = Series(scores,index=students)
S3

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
dtype: int64

In [5]:
S3['Alex']

88

In [6]:
'Gary' in S3

True

In [7]:
'Mike' in S3

False

In [8]:
S3d = S3.to_dict()
S3d

{'Gary': 92, 'Alex': 88, 'Chris': 95, 'Tom': 85, 'Cathy': 98}

In [9]:
S4 = Series( S3d )

In [10]:
S4

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
dtype: int64

In [11]:
pd.isnull(S4)

Gary     False
Alex     False
Chris    False
Tom      False
Cathy    False
dtype: bool

In [12]:
pd.notnull(S4)

Gary     True
Alex     True
Chris    True
Tom      True
Cathy    True
dtype: bool

In [13]:
S3

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
dtype: int64

In [14]:
S4

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
dtype: int64

In [15]:
S3+S4

Gary     184
Alex     176
Chris    190
Tom      170
Cathy    196
dtype: int64

In [16]:
S4

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
dtype: int64

In [17]:
S4.name = "Badminton players"
S4

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
Name: Badminton players, dtype: int64

### Indexing

In [18]:
S4['Gary']

92

In [19]:
S4.index

Index(['Gary', 'Alex', 'Chris', 'Tom', 'Cathy'], dtype='object')

In [20]:
S4.values

array([92, 88, 95, 85, 98], dtype=int64)

In [21]:
S4

Gary     92
Alex     88
Chris    95
Tom      85
Cathy    98
Name: Badminton players, dtype: int64

In [22]:
S4[1]

88

In [23]:
S4[2:]

Chris    95
Tom      85
Cathy    98
Name: Badminton players, dtype: int64

### Reindexing

In [24]:
x = list(range(11,16))
ind = ['A','B','C','D','E']
S5 = Series(x,index=ind)
S5

A    11
B    12
C    13
D    14
E    15
dtype: int64

In [25]:
ind2 = ['A','B','C','D','E','F','G']
S6 = S5.reindex(ind2)
S6

A    11.0
B    12.0
C    13.0
D    14.0
E    15.0
F     NaN
G     NaN
dtype: float64

In [26]:
ind3 = ['A','B','C','D','E','F','G','H','I']
S7 = S6.reindex(ind3,fill_value=0)
S7

A    11.0
B    12.0
C    13.0
D    14.0
E    15.0
F     NaN
G     NaN
H     0.0
I     0.0
dtype: float64

### Selections

In [27]:
S7

A    11.0
B    12.0
C    13.0
D    14.0
E    15.0
F     NaN
G     NaN
H     0.0
I     0.0
dtype: float64

In [28]:
S7 * 2

A    22.0
B    24.0
C    26.0
D    28.0
E    30.0
F     NaN
G     NaN
H     0.0
I     0.0
dtype: float64

In [29]:
S7

A    11.0
B    12.0
C    13.0
D    14.0
E    15.0
F     NaN
G     NaN
H     0.0
I     0.0
dtype: float64

In [30]:
SS = S7.dropna()
SS

A    11.0
B    12.0
C    13.0
D    14.0
E    15.0
H     0.0
I     0.0
dtype: float64

In [31]:
S7['D']

14.0

In [32]:
S7[['C','E','F']]

C    13.0
E    15.0
F     NaN
dtype: float64

In [33]:
S7

A    11.0
B    12.0
C    13.0
D    14.0
E    15.0
F     NaN
G     NaN
H     0.0
I     0.0
dtype: float64

In [34]:
S7[S7>13]

D    14.0
E    15.0
dtype: float64

In [35]:
S7[S7==0] = 100

In [36]:
S7

A     11.0
B     12.0
C     13.0
D     14.0
E     15.0
F      NaN
G      NaN
H    100.0
I    100.0
dtype: float64

### Data Alignment

In [37]:
S8 = Series([0,1,2],index = ['A','B','C'])
S9 = Series([3,4,5,6],index=['A','B','C','D'])

In [38]:
S8

A    0
B    1
C    2
dtype: int64

In [39]:
S9

A    3
B    4
C    5
D    6
dtype: int64

In [40]:
S8+S9

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

### Rank() and Sort()

In [41]:
ind = "a b c d e f g h i j".split()
ind

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [42]:
x = []
for i in range(10):
    x.append(np.random.randint(1,100))
x

[41, 56, 78, 47, 48, 73, 89, 96, 3, 96]

In [43]:
S10 = Series(x,index=ind)

In [44]:
S10

a    41
b    56
c    78
d    47
e    48
f    73
g    89
h    96
i     3
j    96
dtype: int64

In [45]:
S10.rank()

a    2.0
b    5.0
c    7.0
d    3.0
e    4.0
f    6.0
g    8.0
h    9.5
i    1.0
j    9.5
dtype: float64

### Missing data

In [47]:
S11 = Series([100,200,np.nan,400])
S11

0    100.0
1    200.0
2      NaN
3    400.0
dtype: float64

In [48]:
S11.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [49]:
S12 = S11.dropna()
S12

0    100.0
1    200.0
3    400.0
dtype: float64

# DataFrame

In [53]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [57]:
df1 = pd.read_clipboard()
df1

,Date,Open,High,Low,Close*,Adj Close**,Volume
0,"Sep 22, 2021","14,800.60","14,864.17","14,767.01","14,850.74","14,850.74","1,239,760,000"
1,"Sep 21, 2021","14,803.36","14,847.03","14,696.47","14,746.40","14,746.40","4,056,340,000"
2,"Sep 20, 2021","14,758.14","14,841.82","14,530.07","14,713.90","14,713.90","4,860,630,000"
3,"Sep 17, 2021","15,163.36","15,166.56","14,998.73","15,043.97","15,043.97","6,682,650,000"
4,"Sep 16, 2021","15,120.09","15,205.50","15,047.14","15,181.92","15,181.92","3,681,700,000"
5,"Sep 15, 2021","15,071.34","15,174.38","14,984.68","15,161.53","15,161.53","4,446,270,000"
6,"Sep 14, 2021","15,168.45","15,181.19","15,008.30","15,037.76","15,037.76","4,571,950,000"
7,"Sep 13, 2021","15,211.43","15,215.44","15,030.85","15,105.58","15,105.58","4,701,190,000"
8,"Sep 10, 2021","15,332.92","15,349.47","15,111.31","15,115.49","15,115.49","4,567,980,000"
9,"Sep 09, 2021","15,296.06","15,352.38","15,245.17","15,248.25","15,248.25","3,997,250,000"
10,"Sep 08, 2021","15,360.35","15,360.35","15,206.61","15,286.64","15,286.64","4,113,530,000"

In [59]:
df1.columns

Index(['Date', 'Open', 'High', 'Low', 'Close*', 'Adj Close**', 'Volume'], dtype='object')

In [60]:
df1.head()

,Date,Open,High,Low,Close*,Adj Close**,Volume
0,"Sep 22, 2021","14,800.60","14,864.17","14,767.01","14,850.74","14,850.74","1,239,760,000"
1,"Sep 21, 2021","14,803.36","14,847.03","14,696.47","14,746.40","14,746.40","4,056,340,000"
2,"Sep 20, 2021","14,758.14","14,841.82","14,530.07","14,713.90","14,713.90","4,860,630,000"
3,"Sep 17, 2021","15,163.36","15,166.56","14,998.73","15,043.97","15,043.97","6,682,650,000"
4,"Sep 16, 2021","15,120.09","15,205.50","15,047.14","15,181.92","15,181.92","3,681,700,000"

In [61]:
df1.tail()

,Date,Open,High,Low,Close*,Adj Close**,Volume
6,"Sep 14, 2021","15,168.45","15,181.19","15,008.30","15,037.76","15,037.76","4,571,950,000"
7,"Sep 13, 2021","15,211.43","15,215.44","15,030.85","15,105.58","15,105.58","4,701,190,000"
8,"Sep 10, 2021","15,332.92","15,349.47","15,111.31","15,115.49","15,115.49","4,567,980,000"
9,"Sep 09, 2021","15,296.06","15,352.38","15,245.17","15,248.25","15,248.25","3,997,250,000"
10,"Sep 08, 2021","15,360.35","15,360.35","15,206.61","15,286.64","15,286.64","4,113,530,000"

In [62]:
df1.Date

0     Sep 22, 2021
1     Sep 21, 2021
2     Sep 20, 2021
3     Sep 17, 2021
4     Sep 16, 2021
5     Sep 15, 2021
6     Sep 14, 2021
7     Sep 13, 2021
8     Sep 10, 2021
9     Sep 09, 2021
10    Sep 08, 2021
Name: Date, dtype: object

In [63]:
df1.Volume

0     1,239,760,000
1     4,056,340,000
2     4,860,630,000
3     6,682,650,000
4     3,681,700,000
5     4,446,270,000
6     4,571,950,000
7     4,701,190,000
8     4,567,980,000
9     3,997,250,000
10    4,113,530,000
Name: Volume, dtype: object

In [64]:
df1.columns

Index(['Date', 'Open', 'High', 'Low', 'Close*', 'Adj Close**', 'Volume'], dtype='object')

In [65]:
df1[['Date','High','Low','Close*']]

            Date       High        Low     Close*
0   Sep 22, 2021  14,864.17  14,767.01  14,850.74
1   Sep 21, 2021  14,847.03  14,696.47  14,746.40
2   Sep 20, 2021  14,841.82  14,530.07  14,713.90
3   Sep 17, 2021  15,166.56  14,998.73  15,043.97
4   Sep 16, 2021  15,205.50  15,047.14  15,181.92
5   Sep 15, 2021  15,174.38  14,984.68  15,161.53
6   Sep 14, 2021  15,181.19  15,008.30  15,037.76
7   Sep 13, 2021  15,215.44  15,030.85  15,105.58
8   Sep 10, 2021  15,349.47  15,111.31  15,115.49
9   Sep 09, 2021  15,352.38  15,245.17  15,248.25
10  Sep 08, 2021  15,360.35  15,206.61  15,286.64

In [66]:
df1.head()

,Date,Open,High,Low,Close*,Adj Close**,Volume
0,"Sep 22, 2021","14,800.60","14,864.17","14,767.01","14,850.74","14,850.74","1,239,760,000"
1,"Sep 21, 2021","14,803.36","14,847.03","14,696.47","14,746.40","14,746.40","4,056,340,000"
2,"Sep 20, 2021","14,758.14","14,841.82","14,530.07","14,713.90","14,713.90","4,860,630,000"
3,"Sep 17, 2021","15,163.36","15,166.56","14,998.73","15,043.97","15,043.97","6,682,650,000"
4,"Sep 16, 2021","15,120.09","15,205.50","15,047.14","15,181.92","15,181.92","3,681,700,000"

In [67]:
df1['Exchange'] = 'Nasdaq'
df1

,Date,Open,High,Low,Close*,Adj Close**,Volume,Exchange
0,"Sep 22, 2021","14,800.60","14,864.17","14,767.01","14,850.74","14,850.74","1,239,760,000",Nasdaq
1,"Sep 21, 2021","14,803.36","14,847.03","14,696.47","14,746.40","14,746.40","4,056,340,000",Nasdaq
2,"Sep 20, 2021","14,758.14","14,841.82","14,530.07","14,713.90","14,713.90","4,860,630,000",Nasdaq
3,"Sep 17, 2021","15,163.36","15,166.56","14,998.73","15,043.97","15,043.97","6,682,650,000",Nasdaq
4,"Sep 16, 2021","15,120.09","15,205.50","15,047.14","15,181.92","15,181.92","3,681,700,000",Nasdaq
5,"Sep 15, 2021","15,071.34","15,174.38","14,984.68","15,161.53","15,161.53","4,446,270,000",Nasdaq
6,"Sep 14, 2021","15,168.45","15,181.19","15,008.30","15,037.76","15,037.76","4,571,950,000",Nasdaq
7,"Sep 13, 2021","15,211.43","15,215.44","15,030.85","15,105.58","15,105.58","4,701,190,000",Nasdaq
8,"Sep 10, 2021","15,332.92","15,349.47","15,111.31","15,115.49","15,115.49","4,567,980,000",Nasdaq
9,"Sep 09, 2021","15,296.06","15,352.38","15,245.17","15,248.25","15,248.25","3,997,250,000",Nasdaq
10,"Sep 08, 2021","15,360.35","15,360.35","15,206.61","15,286.64","15,286.64","4,113,530,000",Nasdaq

In [68]:
scores = [92,88,95,85,98]
students = ['Gary','Alex','Kris','Tom','Cathy']

In [69]:
#Creating dictionary
data = {'Student':students,'Score':scores}
data

{'Student': ['Gary', 'Alex', 'Kris', 'Tom', 'Cathy'],
 'Score': [92, 88, 95, 85, 98]}

In [70]:
df2 = DataFrame(data)
df2

  Student  Score
0    Gary     92
1    Alex     88
2    Kris     95
3     Tom     85
4   Cathy     98

In [71]:
ind = "A B C D E".split()
cols = " col1 col2 col3 col4 col5".split()

x=[]
for i in range(25):
    x.append(np.random.randint(1,100))

x = np.array(x)
x = x.reshape(5,5)
x

array([[23, 66, 16,  2, 77],
       [30, 95, 72, 95, 36],
       [32, 82, 10, 19, 16],
       [18, 29, 37, 46, 52],
       [30, 79, 43, 13, 83]])

In [72]:
df3 = DataFrame(x, index=ind, columns=cols)
df3

   col1  col2  col3  col4  col5
A    23    66    16     2    77
B    30    95    72    95    36
C    32    82    10    19    16
D    18    29    37    46    52
E    30    79    43    13    83

In [73]:
new_ind = "A B C D E F G".split()

In [74]:
df4 = df3.reindex(new_ind,fill_value = 0)
df4

   col1  col2  col3  col4  col5
A    23    66    16     2    77
B    30    95    72    95    36
C    32    82    10    19    16
D    18    29    37    46    52
E    30    79    43    13    83
F     0     0     0     0     0
G     0     0     0     0     0

In [75]:
new_cols = " col1 col2 col3 col4 col5 col6".split()

In [76]:
df5 = df4.reindex(columns=new_cols,fill_value=0)
df5

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [77]:
df5['col1']

A    23
B    30
C    32
D    18
E    30
F     0
G     0
Name: col1, dtype: int32

In [78]:
df5[['col3','col5']]

   col3  col5
A    16    77
B    72    36
C    10    16
D    37    52
E    43    83
F     0     0
G     0     0

In [79]:
df5

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [80]:
df5['col4'] < 20

A     True
B    False
C     True
D    False
E     True
F     True
G     True
Name: col4, dtype: bool

In [81]:
df5[df5['col4'] < 20]

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
C    32    82    10    19    16     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [82]:
df5<50

   col1   col2   col3   col4   col5  col6
A  True  False   True   True  False  True
B  True  False  False  False   True  True
C  True  False   True   True   True  True
D  True   True   True   True  False  True
E  True  False   True   True  False  True
F  True   True   True   True   True  True
G  True   True   True   True   True  True

In [83]:
df5

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [86]:
# Dropping rows and columns

In [87]:
df5

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [88]:
df5.drop('F')

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
G     0     0     0     0     0     0

In [89]:
df5

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [90]:
# Data alignment = axis for drop: row =0,col =1

In [91]:
df5.drop('col5',axis=1)

   col1  col2  col3  col4  col6
A    23    66    16     2     0
B    30    95    72    95     0
C    32    82    10    19     0
D    18    29    37    46     0
E    30    79    43    13     0
F     0     0     0     0     0
G     0     0     0     0     0

In [92]:
df6 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=list('xy'))
df6

   A  B
x  0  1
y  2  3

In [93]:
df7 = DataFrame(np.arange(9).reshape(3,3),columns=list('ABC'),index=list('xyz'))
df7

   A  B  C
x  0  1  2
y  3  4  5
z  6  7  8

In [94]:
df6 + df7

     A    B   C
x  0.0  2.0 NaN
y  5.0  7.0 NaN
z  NaN  NaN NaN

In [95]:
df6.add(df7,fill_value=0)

     A    B    C
x  0.0  2.0  2.0
y  5.0  7.0  5.0
z  6.0  7.0  8.0

In [96]:
df7.add(df6,fill_value=0)

     A    B    C
x  0.0  2.0  2.0
y  5.0  7.0  5.0
z  6.0  7.0  8.0

In [97]:
# Openrations

In [98]:
df5

   col1  col2  col3  col4  col5  col6
A    23    66    16     2    77     0
B    30    95    72    95    36     0
C    32    82    10    19    16     0
D    18    29    37    46    52     0
E    30    79    43    13    83     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [99]:
df8 = df5.drop(['F','G'])
df9 = df8.drop(['col4','col6'],axis=1)
df9

   col1  col2  col3  col5
A    23    66    16    77
B    30    95    72    36
C    32    82    10    16
D    18    29    37    52
E    30    79    43    83

In [100]:
# axis for sum,max: row =1,col=0

In [101]:
df9.sum()

col1    133
col2    351
col3    178
col5    264
dtype: int64

In [102]:
df9.sum(axis=1)

A    182
B    233
C    140
D    136
E    235
dtype: int64

In [103]:
df9

   col1  col2  col3  col5
A    23    66    16    77
B    30    95    72    36
C    32    82    10    16
D    18    29    37    52
E    30    79    43    83

In [104]:
df9.max()

col1    32
col2    95
col3    72
col5    83
dtype: int32

In [105]:
df9

   col1  col2  col3  col5
A    23    66    16    77
B    30    95    72    36
C    32    82    10    16
D    18    29    37    52
E    30    79    43    83

In [106]:
df9.idxmax()

col1    C
col2    B
col3    B
col5    E
dtype: object

In [107]:
df9

   col1  col2  col3  col5
A    23    66    16    77
B    30    95    72    36
C    32    82    10    16
D    18    29    37    52
E    30    79    43    83

In [108]:
df9.cumsum()

   col1  col2  col3  col5
A    23    66    16    77
B    53   161    88   113
C    85   243    98   129
D   103   272   135   181
E   133   351   178   264

In [109]:
df9.describe()

            col1       col2       col3       col5
count   5.000000   5.000000   5.000000   5.000000
mean   26.600000  70.200000  35.600000  52.800000
std     5.899152  25.232915  24.602845  27.994642
min    18.000000  29.000000  10.000000  16.000000
25%    23.000000  66.000000  16.000000  36.000000
50%    30.000000  79.000000  37.000000  52.000000
75%    30.000000  82.000000  43.000000  77.000000
max    32.000000  95.000000  72.000000  83.000000

In [110]:
nd = np.nan
A = [1,2,3]
B = [4,nd,6]
C = [nd,8,nd]
D = [nd,nd,nd]
df10 = DataFrame([A,B,C,D])
df10

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [111]:
df10.dropna()

     0    1    2
0  1.0  2.0  3.0

In [112]:
df10.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN

In [113]:
df10

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [114]:
df10.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0

In [115]:
df10.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [116]:
df10

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [117]:
df10.fillna(100)

       0      1      2
0    1.0    2.0    3.0
1    4.0  100.0    6.0
2  100.0    8.0  100.0
3  100.0  100.0  100.0

In [118]:
df10

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [119]:
df10.fillna(0,inplace=True)
df10

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  6.0
2  0.0  8.0  0.0
3  0.0  0.0  0.0

In [120]:
# Multilevel indexing

In [121]:
ind1 = "A A A B B B".split()
ind2 = "a b c a b c".split()
cols1 = "C1 C2 C2 C3 C3".split()
cols2 = "col1 col2 col3 col4 col5".split()

x=[]
for i in range(30):
    x.append(np.random.randint(1,100))

x= np.array(x)
x= x.reshape(6,5)
x

array([[47, 83, 46, 71, 41],
       [ 3, 82, 56, 45, 65],
       [83, 62, 13, 22, 74],
       [53, 48, 96, 24, 28],
       [21, 17, 93, 13, 19],
       [99, 34, 43, 88, 97]])

In [122]:
df11 = DataFrame(x,index=[ind1,ind2],columns=[cols1,cols2])
df11

      C1   C2        C3
    col1 col2 col3 col4 col5
A a   47   83   46   71   41
  b    3   82   56   45   65
  c   83   62   13   22   74
B a   53   48   96   24   28
  b   21   17   93   13   19
  c   99   34   43   88   97

In [123]:
df11['C2']

     col2  col3
A a    83    46
  b    82    56
  c    62    13
B a    48    96
  b    17    93
  c    34    43

In [124]:
df11[['C1','C3']]

      C1   C3
    col1 col4 col5
A a   47   71   41
  b    3   45   65
  c   83   22   74
B a   53   24   28
  b   21   13   19
  c   99   88   97

# Exercise

## Exercise 1: From the given dataset print the first and last five rows

In [24]:
import pandas as pd
df = pd.read_csv("E:\Automobile_data.csv")
df.head(25)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
10,13,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
14,17,chevrolet,hatchback,94.5,155.9,ohc,four,70,38,6295.0
15,18,chevrolet,sedan,94.5,158.8,ohc,four,70,38,6575.0
16,19,dodge,hatchback,93.7,157.3,ohc,four,68,31,6377.0
17,20,dodge,hatchback,93.7,157.3,ohc,four,68,31,6229.0
18,27,honda,wagon,96.5,157.1,ohc,four,76,30,7295.0
19,28,honda,sedan,96.5,175.4,ohc,four,101,24,12945.0
20,29,honda,sedan,96.5,169.1,ohc,four,100,25,10345.0
21,30,isuzu,sedan,94.3,170.7,ohc,four,78,24,6785.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
24,33,jaguar,sedan,113.0,199.6,dohc,six,176,15,32250.0

In [8]:
df.tail()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

## Exercise 2: Clean the dataset and update the CSV file
Replace all column values which contain ?, n.a, or NaN.

In [14]:
table = pd.read_clipboard()
table.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [23]:
df = pd.read_clipboard(
na_values = {'price':["?","n.a"],
'stroke':["?","n.a"],
'horsepower':["?","n.a"],
'peak-rpm':["?","n.a"],
'average-mileage':["?","n.a"]})
print (df.head(25))

    index      company   body-style  wheel-base  length engine-type  \
0       0  alfa-romero  convertible        88.6   168.8        dohc
1       1  alfa-romero  convertible        88.6   168.8        dohc
2       2  alfa-romero    hatchback        94.5   171.2        ohcv
3       3         audi        sedan        99.8   176.6         ohc
4       4         audi        sedan        99.4   176.6         ohc
5       5         audi        sedan        99.8   177.3         ohc
6       6         audi        wagon       105.8   192.7         ohc
7       9          bmw        sedan       101.2   176.8         ohc
8      10          bmw        sedan       101.2   176.8         ohc
9      11          bmw        sedan       101.2   176.8         ohc
10     13          bmw        sedan       103.5   189.0         ohc
11     14          bmw        sedan       103.5   193.8         ohc
12     15          bmw        sedan       110.0   197.0         ohc
13     16    chevrolet    hatchback        88.4   141.1           l
14     17    chevrolet    hatchback        94.5   155.9         ohc
15     18    chevrolet        sedan        94.5   158.8         ohc
16     19        dodge    hatchback        93.7   157.3         ohc
17     20        dodge    hatchback        93.7   157.3         ohc
18     27        honda        wagon        96.5   157.1         ohc
19     28        honda        sedan        96.5   175.4         ohc
20     29        honda        sedan        96.5   169.1         ohc
21     30        isuzu        sedan        94.3   170.7         ohc
22     31        isuzu        sedan        94.5   155.9         ohc
23     32        isuzu        sedan        94.5   155.9         ohc
24     33       jaguar        sedan       113.0   199.6        dohc

   num-of-cylinders  horsepower  average-mileage    price
0              four         111               21  13495.0
1              four         111               21  16500.0
2               six         154               19  16500.0
3              four         102               24  13950.0
4              five         115               18  17450.0
5              five         110               19  15250.0
6              five         110               19  18920.0
7              four         101               23  16430.0
8              four         101               23  16925.0
9               six         121               21  20970.0
10              six         182               16  30760.0
11              six         182               16  41315.0
12              six         182               15  36880.0
13            three          48               47   5151.0
14             four          70               38   6295.0
15             four          70               38   6575.0
16             four          68               31   6377.0
17             four          68               31   6229.0
18             four          76               30   7295.0
19             four         101               24  12945.0
20             four         100               25  10345.0
21             four          78               24   6785.0
22             four          70               38      NaN
23             four          70               38      NaN
24              six         176               15  32250.0

In [26]:
df = table[['company','price']][table.price==table['price'].max()]
df

          company    price
35  mercedes-benz  45400.0

In [27]:
df1=table[table.company=='toyota']
df1

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [30]:
df2=table['company'].value_counts()
df2

toyota           7
bmw              6
nissan           5
mazda            5
mitsubishi       4
audi             4
mercedes-benz    4
volkswagen       4
jaguar           3
chevrolet        3
isuzu            3
porsche          3
alfa-romero      3
honda            3
volvo            2
dodge            2
Name: company, dtype: int64

In [39]:
car_Manufacturers = table.groupby('company')
priceDf = car_Manufacturers['company','price'].max()
priceDf

<ipython-input-39-6659d1b0f194>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  priceDf = car_Manufacturers['company','price'].max()

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

In [57]:
group = table.groupby('company')
result = group['average-mileage'].mean()
result

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

In [49]:
print(dir(group))

['__annotations__', '__class__', '__class_getitem__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__module__', '__ne__', '__new__', '__orig_bases__', '__parameters__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__slots__', '__str__', '__subclasshook__', '__weakref__', '_accessors', '_agg_examples_doc', '_agg_general', '_aggregate', '_aggregate_frame', '_aggregate_item_by_item', '_aggregate_multiple_funcs', '_apply_allowlist', '_apply_filter', '_apply_to_column_groupbys', '_assure_grouper', '_bool_agg', '_builtin_table', '_choose_path', '_concat_objects', '_constructor', '_cumcount_array', '_cython_agg_blocks', '_cython_agg_general', '_cython_table', '_cython_transform', '_define_paths', '_deprecations', '_dir_additions', '_dir_deletions', '_fill', '_get_cython_func', '_get_cythonized_result', '_get_data_to_aggregate', '_get_index', '_get_indices', '_gotitem', '_group_selection', '_insert_inaxis_grouper_inplace', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_protocol', '_iterate_column_groupbys', '_iterate_slices', '_make_wrapper', '_obj_1d_constructor', '_obj_with_exclusions', '_python_agg_general', '_python_apply_general', '_reindex_output', '_reset_cache', '_reset_group_selection', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_group_selection', '_set_result_index_ordered', '_transform_fast', '_transform_general', '_transform_item_by_item', '_transform_should_cast', '_try_aggregate_string_function', '_wrap_agged_blocks', '_wrap_aggregated_output', '_wrap_applied_output', '_wrap_frame_output', '_wrap_transformed_output', 'agg', 'aggregate', 'all', 'any', 'apply', 'backfill', 'bfill', 'boxplot', 'company', 'corr', 'corrwith', 'count', 'cov', 'cumcount', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'dtypes', 'expanding', 'ffill', 'fillna', 'filter', 'first', 'get_group', 'groups', 'head', 'hist', 'horsepower', 'idxmax', 'idxmin', 'index', 'indices', 'last', 'length', 'mad', 'max', 'mean', 'median', 'min', 'ndim', 'ngroup', 'ngroups', 'nth', 'nunique', 'ohlc', 'pad', 'pct_change', 'pipe', 'plot', 'price', 'prod', 'quantile', 'rank', 'resample', 'rolling', 'sample', 'sem', 'shift', 'size', 'skew', 'std', 'sum', 'tail', 'take', 'transform', 'tshift', 'var']

In [61]:
carsdf = table.sort_values(by=['price', 'horsepower'], ascending=False)
carsdf.head(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

In [69]:
Germancars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
carsdf1=pd.DataFrame.from_dict(Germancars)
japanesecars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
carsdf2 = pd.DataFrame.from_dict(japanesecars)
carsdf=pd.concat([carsdf1,carsdf2],keys=['Germany','Japan'])
carsdf

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

In [70]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
df1 = pd.DataFrame.from_dict(Car_Price)
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}
df2 = pd.DataFrame.from_dict(car_Horsepower)
carsDf = pd.merge(df1,df2, on="Company")
carsDf

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160